list01 = [1, 2, 3, 4, 5, 6, 7]
print(f"列表是: {list01},内存地址是: {id(list01)}")   # 列表的内存地址
for i in list01:    # 列表中每个值的内存地址
    print(f"列表的值是: {i},内存地址是: {id(i)}")

# 添加操作，查看内存地址
list01.append(8)
list01.append(9)
print("------------------------------------------------------")
print(f"添加操作之后列表是: {list01},内存地址是: {id(list01)}")   # 列表的内存地址
for i in list01:    # 列表中每个值的内存地址
    print(f"添加操作之后列表的值是: {i},内存地址是: {id(i)}")

# 赋值操作，查看内存地址
list01[1] = 11
list01[2] = 12
print("------------------------------------------------------")
print(f"赋值操作之后列表是: {list01},内存地址是: {id(list01)}")   # 列表的内存地址
for i in list01:    # 列表中每个值的内存地址
    print(f"赋值操作之后列表的值是: {i},内存地址是: {id(i)}")

